# 판다스 자료구조

In [1]:
#pandas 호출 
#as 뒤에 alias 지정
import pandas as pd

## 시리즈 만들기
~~~python
딕셔너리 → 시리즈 변환 : pandas.Series(dict)
~~~

In [2]:
#pandas 호출 
#as 뒤에 alias 지정
import pandas as pd

In [11]:
#키 → 인덱스 / 밸류 → 데이터

dict_data = {'a': 1, 'b': 2, 'c': 3}

In [12]:
# 판다스 Series() 함수로 딕셔너리(dict_data)를 시리즈로 변환. 변수 sr에 저장

sr = pd.Series(dict_data)

In [15]:
#sr의 자료형 출력
print(type(sr))

<class 'pandas.core.series.Series'>

In [16]:
#sr에 저장되어 있는 시리즈 객체 출력
print(sr)

a    1
b    2
c    3
dtype: int64

## 시리즈 인덱스
~~~python
인덱스 배열 : Series.index
데이터 값 배열 : Series.value
~~~

In [17]:
#리스트 → 시리즈 변환
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]

In [18]:
# 리스트를 시리즈로 변환하여 변수 sr에 저장

sr = pd.Series(list_data)

In [19]:
#시리즈 객체 출력
print(sr)

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [22]:
# 인덱스 배열은 변수 idx에 저장
# 데이터 값 배열은 변수 val에 저장

idx = sr.index
val = sr.values

In [23]:
# 인덱스, 데이터 각각 출력

print(idx)
print(val)

RangeIndex(start=0, stop=5, step=1)
['2019-01-02' 3.14 'ABC' 100 True]

## 원소 선택
~~~python
정수 인덱싱 : Series[숫자]
이름 인덱싱 : Series["이름"]
여러 원소 인덱싱 : Series[index, index]
구간 인덱싱 : Series[index:index]
~~~

In [25]:
# 튜플을 시리즈로 변환(index 옵션에 인덱스 이름을 지정)
# 인덱스 이름(순서대로) : ['이름', '생년월일', '성별', '학생여부']
tup_data = ('영인', '2010-05-01', '여', True)

sr = pd.Series(tup_data, index=['이름', '생년월일', '성별', '학생여부'])
print(sr)

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [28]:
# 원소를 1개 선택
# sr의 1 번째 원소를 선택 (정수형 위치 인덱스를 활용)
print(sr[1])

# '이름' 라벨을 가진 원소를 선택 (인덱스 이름을 활용)
print(sr["생년월일"])

2010-05-01
2010-05-01

In [32]:
# 여러 개의 원소를 선택 (인덱스 리스트 활용)
print(sr[[0,1]])
print(sr[["이름", "생년월일"]])

이름              영인
생년월일    2010-05-01
dtype: object
이름              영인
생년월일    2010-05-01
dtype: object

In [35]:
# 여러 개의 원소를 선택 (인덱스 범위 지정)
print(sr[1:])
print(sr["생년월일":"성별"])

생년월일    2010-05-01
성별               여
학생여부          True
dtype: object
생년월일    2010-05-01
성별               여
dtype: object

## 데이터 프레임 만들기
~~~python
딕셔너리 → 데이터 프레임 : pandas.DataFrame(딕셔너리 객체)
~~~

In [80]:
# 열 이름을 key로 하고, 리스트를 value로 갖는 딕셔너리 정의(2차원 배열)
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

df = pd.DataFrame(dict_data)

In [81]:
# df의 자료형 출력
print(type(df))
# 변수 df에 저장되어 있는 데이터프레임 객체를 출력
print(df)
df.head()

<class 'pandas.core.frame.DataFrame'>
   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

## 행 인덱스 / 열 이름 설정
~~~python
행 인덱스 / 열 이름 설정 : pandas.DataFrame(2차원 배열, index=행 인덱스 배열, columns=열 이름 배열)
~~~

In [82]:
# 행 인덱스/열 이름 지정하여, 데이터프레임 만들기

data = [[15, '남', '덕영중'], [17, '여', '수리중']]
idx = ['준서', '예은']
col = ['나이', '성별', '학교']

dict_data = {"나이": [15, 17], "성별": ["남", "여"], "학교": ["덕영중", "수리중"]}

df = pd.DataFrame(data, index=idx, columns=col)
df1 = pd.DataFrame(dict_data, )
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [83]:
# 데이터 프레임, 행 인덱스, 열 이름 확인하기
print(df.columns)
print(df.index)

Index(['나이', '성별', '학교'], dtype='object')
Index(['준서', '예은'], dtype='object')

## 행 인덱스 /열 이름 변경하기 #1
~~~python
행 인덱스 변경 : df.index = [행 인덱스]
열 이름 변경 : df.columns = [열 이름]
~~~

In [84]:
# 행 인덱스, 열 이름 변경하기
new_idx = ['학생1', '학생2']
new_col = ['연령', '남녀', '소속']

df.index = new_idx
df.columns = new_col

In [85]:
# 데이터 프레임, 행 인덱스, 열 이름 확인하기
df.head()

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

## 행 인덱스 /열 이름 변경하기 #2
~~~python
행 인덱스 변경 : df.rename(index={기존 인덱스: 새 인덱스, 기존 인덱스: 새 인덱스, ..., 기존 인덱스: 새 인덱스})
열 이름 변경 : df.rename(columns={기존 이름: 새 이름, 기존 이름: 새 이름, ..., 기존 이름: 새 이름})
~~~

In [90]:
# 열 이름 중, '남녀'을 '성별'로, '소속'를 '학교'으로 바꾸기
df = df.rename(columns={"남녀":"성별", "소속":"학교"})

# df의 행 인덱스 중에서, '준서'를 '학생1'로, '예은'을 '학생2'로 바꾸기
df.rename(index={"학생1":"준서", "학생2":"예은"}, inplace=True)

In [91]:
# df 출력(변경 후)
df

    연령 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

## 행/열 삭제하기
~~~python
행 삭제 : df.drop(행 인덱스/배열, axis=0)
열 삭제 : df.drop(열 이름/배열, axis=1)
~~~

In [94]:
# DataFrame() 함수로 데이터프레임 변환
# 변수 df에 저장 
# index=['서준', '우현', '인아']
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

### 행 삭제

In [96]:
# 데이터프레임 df를 복제하여 변수 df2에 저장
# df2의 1개 행(row)을 삭제
df2 = df[:]
df2.drop('서준', inplace=True)
df2

/Users/yehoon/opt/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:4102: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

    수학  영어   음악  체육
우현  80  89   95  90
인아  70  95  100  90

In [100]:
# 데이터프레임 df를 복제하여 변수 df3에 저장
# df3의 2개 행(row)을 삭제
df3=df[:]
df3.drop(["우현", "인아"], inplace=True)
df3

    수학  영어  음악   체육
서준  90  98  85  100

### 열 삭제

In [101]:
# 데이터프레임 df를 복제하여 변수 df4에 저장
# df4의 1개 열(column)을 삭제
df4=df[:]
df4.drop("수학", axis=1, inplace=True)
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [103]:
# 데이터프레임 df를 복제하여 변수 df5에 저장
# df5의 2개 열(column)을 삭제
df5=df[:]
df5.drop(["수학", "체육"], axis=1, inplace=True)
df5

    영어   음악
서준  98   85
우현  89   95
인아  95  100

## 행 선택
~~~python
df.loc[행 이름] / df.iloc[인덱스]
~~~

In [105]:
# 행 인덱스를 사용하여 행 1개를 선택
# loc 인덱서 활용
df.loc["서준"]

# iloc 인덱서 활용
df.iloc[0]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [108]:
# 행 인덱스를 사용하여 2개 이상의 행 선택
# loc 인덱서 활용
df.loc[["서준", "인아"],]
# iloc 인덱서 활용
df.iloc[[0, 2]]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [114]:
# 행 인덱스의 범위를 지정하여 행 선택
# loc 인덱서 활용
df.loc["서준":"인아":2]
# iloc 인덱서 활용
df.iloc[0::2]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

### 행 선택 심화 ‼️

In [97]:
# iloc 슬라이싱 간격
# 행 인덱스를 사용하여 iloc로 홀수 행만 출력

## 열 선택
~~~python
열 1개 선택 : df[열 이름] / df.열 이름 (열 이름이 문자열일 경우만 가능)
열 n개 선택 : df[열 이름 배열]
~~~

In [124]:
# '수학' 점수 데이터만 선택
# 변수 math1에 저장
df["수학"]

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [123]:
# '영어' 점수 데이터만 선택
# 변수 english에 저장
df.영어

서준    98
우현    89
인아    95
Name: 영어, dtype: int64

In [126]:
# '음악', '체육' 점수 데이터를 선택
# 변수 music_gym 에 저장

df[["음악", "체육"]]

     음악   체육
서준   85  100
우현   95   90
인아  100   90

In [144]:
cols = list(df.columns) #columns 슬라이싱을 위해 리스트로 변환
print(cols)
df[cols[0:2]]

['수학', '영어', '음악', '체육']

    수학  영어
서준  90  98
우현  80  89
인아  70  95

## 원소 선택
~~~python
인덱스 이름 : df.loc[행 이름, 열 이름]
정수형 : df.iloc[행 번호, 열 번호]
~~~

In [164]:
# '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경사항 반영
# 새로운 인덱스 지정: df.set_index()
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [165]:
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [166]:
# 데이터프레임 df의 특정 원소 1개 선택 ('서준'의 '음악' 점수)
df.loc['서준', '음악']

85

In [168]:
# 데이터프레임 df의 특정 원소 2개 이상 선택 ('서준'의 '음악', '체육' 점수) 
df.loc['서준',['음악', '체육']]

음악     85
체육    100
Name: 서준, dtype: int64

In [170]:
# df의 2개 이상의 행과 열로부터 원소 선택 ('서준'~'인아'의 '영어'~'체육' 점수) 
df.loc["서준":"인아", "영어":"체육"]

    영어   음악   체육
이름
서준  98   85  100
우현  89   95   90
인아  95  100   90

## 열 추가
~~~python
df[추가 하려는 열 이름] = (시리즈) 데이터
~~~

In [172]:
# 데이터프레임 df에 '국어' 점수 열(column)을 추가
# 데이터 값은 80 지정
df["국어"] = 80
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [173]:
df["국어"] =[100, 90, 80]
df

    수학  영어   음악   체육   국어
이름
서준  90  98   85  100  100
우현  80  89   95   90   90
인아  70  95  100   90   80

## 행 추가
~~~python
df.loc[새로운 행 이름] = (시리즈) 데이터
~~~

In [176]:
# 새로운 행(row)을 추가 - 같은 원소 값을 입력
# 데이터 = 0
df.loc["동규"] = 0
df

    수학  영어   음악   체육   국어
이름
서준  90  98   85  100  100
우현  80  89   95   90   90
인아  70  95  100   90   80
동규   0   0    0    0    0

In [180]:
# 새로운 행(row)을 추가 - 원소 값 여러 개의 배열 입력
# 데이터 = ['동규', 90, 80, 70, 60]
df.loc[5] = [90, 80, 70, 60, 0]
df

    수학  영어   음악   체육   국어
이름
서준  90  98   85  100  100
우현  80  89   95   90   90
인아  70  95  100   90   80
동규   0   0    0    0    0
5   90  80   70   60    0

In [113]:
# 새로운 행(row)을 추가 - 기존 행을 복사
# 3번째 행 복사
df.loc[5] = df.loc["동규"]

## 원소 값 변경
~~~python
df 객체 또는 원소 선택 = 데이터
~~~

In [182]:
df

    수학  영어   음악   체육   국어
이름
서준  90  98   85  100  100
우현  80  89   95   90   90
인아  70  95  100   90   80
동규   0   0    0    0    0
5   90  80   70   60    0

In [184]:
# 데이터프레임 df의 특정 원소를 변경하는 방법: '서준'의 '체육' 점수
# iloc - 80
df.iloc[0,3] = 80
df

    수학  영어   음악  체육   국어
이름
서준  90  98   85  80  100
우현  80  89   95  90   90
인아  70  95  100  90   80
동규   0   0    0   0    0
5   90  80   70  60    0

In [185]:
df.iloc[0,0:2] = [100, 90]
df

     수학  영어   음악  체육   국어
이름
서준  100  90   85  80  100
우현   80  89   95  90   90
인아   70  95  100  90   80
동규    0   0    0   0    0
5    90  80   70  60    0

In [188]:
# loc - 90
df.loc["서준", "음악"] = 90
df

     수학  영어   음악  체육   국어
이름
서준  100  90   90  80  100
우현   80  89   95  90   90
인아   70  95  100  90   80
동규    0   0    0   0    0
5    90  80   70  60    0

In [189]:
# 데이터프레임 df의 원소 여러 개를 변경하는 방법: '서준'의 '음악', '체육' 점수
# loc - 50
df.loc['서준', ['음악', '체육']] = [98, 85]
df

     수학  영어   음악  체육   국어
이름
서준  100  90   98  85  100
우현   80  89   95  90   90
인아   70  95  100  90   80
동규    0   0    0   0    0
5    90  80   70  60    0

## 행, 열의 위치 바꾸기
~~~python
df.transpose() / df.T
~~~

In [190]:
# 데이터프레임 df를 전치하기 (transpose() 메소드 활용)
df = df.transpose()
df

이름   서준  우현   인아  동규   5
수학  100  80   70   0  90
영어   90  89   95   0  80
음악   98  95  100   0  70
체육   85  90   90   0  60
국어  100  90   80   0   0

In [191]:
# 데이터프레임 df를 다시 전치하기 (T 클래스 속성 활용)
df = df.T
df

     수학  영어   음악  체육   국어
이름
서준  100  90   98  85  100
우현   80  89   95  90   90
인아   70  95  100  90   80
동규    0   0    0   0    0
5    90  80   70  60    0

## 특정 열을 행 인덱스로 설정
~~~python
df.set_index([열 이름]) / df.set_index(열 이름)
~~~

In [193]:
# 특정 열(column)을 데이터프레임의 행 인덱스(index)로 설정 
# '이름'
df

     수학  영어   음악  체육   국어
이름
서준  100  90   98  85  100
우현   80  89   95  90   90
인아   70  95  100  90   80
동규    0   0    0   0    0
5    90  80   70  60    0

In [194]:
# 특정 열(column)을 데이터프레임의 행 인덱스(index)로 설정 
# '음악'

exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [195]:
df1 = df.set_index(["음악"])
df1

     이름  수학  영어   체육
음악
85   서준  90  98  100
95   우현  80  89   90
100  인아  70  95   90

In [196]:
# 특정 열(column)을 데이터프레임의 행 인덱스(index)로 설정 
# '수학', '음악'
df2 = df.set_index(["수학", "음악"])
df2

        이름  영어   체육
수학 음악
90 85   서준  98  100
80 95   우현  89   90
70 100  인아  95   90

## 행 인덱스 재배열
~~~python
df.reindex(새로운 인덱스 배열)
~~~

In [199]:
# 딕셔서리를 데이터프레임으로 변환
# index = ['r0', 'r1', 'r2']
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [201]:
# 인덱스 재지정
index = ['r0', 'r1', 'r2', 'r3', 'r4'] 
df1 = df.reindex(index)
df1

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [202]:
# reindex로 발생한 NaN값을 숫자 0으로 채우기
# fill_value 
df2 = df.reindex(index, fill_value=0)
df2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

## 행 인덱스 초기화
~~~python
df.reset_index()
~~~

In [203]:
# 행 인덱스를 정수형으로 초기화 
df1 = df.reset_index()
df1

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [204]:
df2 = df1.reset_index()
df2

   level_0 index  c0  c1  c2  c3  c4
0        0    r0   1   4   7  10  13
1        1    r1   2   5   8  11  14
2        2    r2   3   6   9  12  15

## 행 인덱스를 기준으로 데이터프레임 정렬
~~~python
df.sort_index()
~~~

In [206]:
# 내림차순으로 행 인덱스 정렬 
# ascending 클래스 속성
df1 = df.sort_index(ascending=False)
df1

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

## 특정 열의 데이터 값을 기준으로 데이터프레임 정렬
~~~python
df.sort_values()
~~~

In [210]:
# c1 열을 기준으로 내림차순 정렬
# by 클래스 속성
df1=df.sort_values('c1', ascending=False)
df1

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

## 시리즈와 숫자
~~~python
Series + 연산자(+, -, *, /) + 숫자
~~~

In [134]:
# 딕셔너리 데이터로 판다스 시리즈 만들기
# 딕셔너리 = {'국어':100, '영어':80, '수학':90}

In [135]:
# 학생의 과목별 점수를 200으로 나누기

## 시리즈와 시리즈
~~~python
Series + 연산자(+, -, *, /) + Series
~~~

In [136]:
# 딕셔너리 데이터로 판다스 시리즈 만들기
# 딕셔너리 1 = {'국어':100, '영어':80, '수학':90}
# 딕셔너리 2 = {'수학':80, '국어':90, '영어':80}

In [137]:
# 두 학생의 과목별 점수로 사칙연산 수행
#덧셈

#뺄셈

#곱셈

#나눗셈

In [138]:
# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
# index=['덧셈', '뺄셈', '곱셈', '나눗셈']

### 시리즈와 시리즈 - NaN

In [139]:
# 딕셔너리 데이터로 판다스 시리즈 만들기
# 딕셔너리 1 = {'국어':np.nan, '영어':80, '수학':90}
# 딕셔너리 2 = {'수학':80, '국어':90}

In [140]:
# 두 학생의 과목별 점수로 사칙연산 수행
#덧셈

#뺄셈

#곱셈

#나눗셈

In [141]:
# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
# index=['덧셈', '뺄셈', '곱셈', '나눗셈']

## 연산 메서드
~~~python
연산 결과 NaN 값 대체 : fill_value()
~~~

In [142]:
# 딕셔너리 데이터로 판다스 시리즈 만들기
# 딕셔너리 1 = {'국어':np.nan, '영어':80, '수학':90}
# 딕셔너리 2 = {'수학':80, '국어':90}

In [143]:
# 두 학생의 과목별 점수로 사칙연산 수행 (연산 메소드 사용)
# fill_value, 0

#덧셈

#뺄셈

#곱셈

#나눗셈

In [144]:
# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
# index=['덧셈', '뺄셈', '곱셈', '나눗셈']

## 데이터 프레임과 숫자
~~~python
DataFrame + 연산자(+, -, *, /) + 숫자
~~~

In [150]:
import seaborn as sns

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
# 열 = ["age", "fare"]
titanic = sns.load_dataset('titanic')

In [151]:
# 데이터프레임에 숫자 10 더하기

## 데이터 프레임과 데이터 프레임
~~~python
DataFrame + 연산자(+, -, *, /) + DataFrame
~~~

In [152]:
# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
# 열 = ["age", "fare"]
titanic = sns.load_dataset('titanic')

In [153]:
# 데이터프레임에 숫자 10 더하기

In [154]:
# 데이터프레임끼리 연산하기 (additon - df)